# DataFrame

In [4]:
import pandas as pd

In [6]:
file1 = pd.Series({'Name':'Mark',
                   'Department':'IT'})
file2 = pd.Series({'Name':'Jack',
                  'Department':'Marketing'})
file3 = pd.Series({'Name':'Tom',
                  'Department':'IT'})

In [7]:
df = pd.DataFrame([file1,file2,file3],
                 index=['emp1','emp2','emp3'])

In [8]:
df.head()

      Name Department
emp1  Mark         IT
emp2  Jack  Marketing
emp3   Tom         IT

In [9]:
file = [{'Name':'Mark',
         'Department':'IT'},
       {'Name':'Jack',
        'Department':'Marketing'},
       {'Name':'Tom',
        'Department':'IT'}]
df = pd.DataFrame(file, index=['emp1','emp2','emp3'])
df.head()

      Name Department
emp1  Mark         IT
emp2  Jack  Marketing
emp3   Tom         IT

In [12]:
df.T

            emp1       emp2 emp3
Name        Mark       Jack  Tom
Department    IT  Marketing   IT

In [13]:
df.drop('emp1')

      Name Department
emp2  Jack  Marketing
emp3   Tom         IT

In [16]:
# but if we look at original Data Frame we can see the data is still intact.
df

      Name Department
emp1  Mark         IT
emp2  Jack  Marketing
emp3   Tom         IT

In [18]:
# let make copy of dataframe using .copy()
df_copy = df.copy()

In [20]:
# now let's drop the department column in this copy.
df_copy.drop("Department", inplace=True, axis=1)
df_copy

      Name
emp1  Mark
emp2  Jack
emp3   Tom

In [21]:
df['level'] = None
df

      Name Department level
emp1  Mark         IT  None
emp2  Jack  Marketing  None
emp3   Tom         IT  None